02_CONF_FILES/01_ACCOMPLISHMENT_1_0/DataProcessors/ЗагрузкаСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСпецификаций</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

02_CONF_FILES/01_ACCOMPLISHMENT_1_0/Catalogs/СпецификацииКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СпецификацииКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСпецификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСпецификации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураКлиента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

02_CONF_FILES/01_ACCOMPLISHMENT_1_0/Catalogs/НоменклатураКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>НоменклатураКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

02_CONF_FILES/01_ACCOMPLISHMENT_1_0/DataProcessors/ЗагрузкаСпецификаций/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ЕстьОшибкиЗаполнения = Ложь;
	
	Если НомерСпецификации = "" Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка невозможна! Не указан номер спецификации.";  
		Сообщение.Поле = "НомерСпецификации";
		Сообщение.Сообщить();
		ЕстьОшибкиЗаполнения = Истина;

	КонецЕсли;

	Если ДатаСпецификации = Дата(1,1,1) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка невозможна! Не указана дата спецификации."; 
		Сообщение.Поле = "ДатаСпецификации";
		Сообщение.Сообщить();
		ЕстьОшибкиЗаполнения = Истина;

	КонецЕсли;

	Если Клиент.Пустая() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка невозможна! Не указан клиент.";  
		Сообщение.Поле = "Клиент";
		Сообщение.Сообщить();
		ЕстьОшибкиЗаполнения = Истина;

	КонецЕсли;

	Если ФайлСпецификации = "" Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка невозможна! Не выбран файл с данными.";  
		Сообщение.Поле = "ФайлСпецификации";
		Сообщение.Сообщить();
		ЕстьОшибкиЗаполнения = Истина;

	КонецЕсли;

	Если ЕстьОшибкиЗаполнения Тогда
		Возврат;	
	Иначе
		ЗагрузкаФайлаВТабличныйДокументНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлСпецификацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Фильтр = "Файлы Excel (*.xls;*.xlsx)|*.xls;*.xlsx";
	Диалог.Заголовок = "Выберитие файл с данными спецификации";
	Диалог.МножественныйВыбор = Ложь;

	Если Диалог.Выбрать() Тогда
        ФайлСпецификации = Диалог.ПолноеИмяФайла;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузкаФайлаВТабличныйДокументНаСервере()  
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
	
	ЭксельКнига = Эксель.Workbooks.Open(ФайлСпецификации);
	Лист = ЭксельКнига.Sheets(1); 
	
	ТаблицаДанныхСпецификации = Новый ТаблицаЗначений;
	
	ТаблицаДанныхСпецификации.Колонки.Добавить("КодНоменклатуры",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(30)));
	ТаблицаДанныхСпецификации.Колонки.Добавить("НаименованиеНоменклатуры",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(600)));
	ТаблицаДанныхСпецификации.Колонки.Добавить("АртикулНоменклатуры",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(300)));
    ТаблицаДанныхСпецификации.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДанныхСпецификации.Колонки.Добавить("Цена",Метаданные.ОпределяемыеТипы.Цена.Тип);
	
	ПродолжаемЦикл = Истина;
	СчетчикСтрок = 2;   
	МассивОшибок = Новый Массив;

	Пока ПродолжаемЦикл Цикл 
		
		Наименование = СокрЛП(Лист.Cells(СчетчикСтрок, 2).Value);   
		
		Если Наименование = "" Тогда 
			ПродолжаемЦикл = Ложь;  
			Продолжить;     
			
		КонецЕсли;               
				
		ДобавитьСтрокуСДаннымиВТаблицу(ТаблицаДанныхСпецификации,Лист,СчетчикСтрок,МассивОшибок); 
				
		СчетчикСтрок = СчетчикСтрок + 1;  
		
	КонецЦикла;  
	
	НайденыОшибкиВДанныхФайла = Ложь;
	
	Если МассивОшибок.Количество() Тогда
		НайденыОшибкиВДанныхФайла = Истина;
	
		Для каждого СтрокаОшибки Из МассивОшибок Цикл
			Сообщить(СтрокаОшибки);		
		КонецЦикла;  
		
		//ДАЛЕЕ ЗДЕСЬ ВОПРОС ПОЛЬЗОВАТЕЛЮ О ПРОДОЛЖЕНИИ ЗАГРУЗКИ
		ЗагрузитьДанныеВСправочники(ТаблицаДанныхСпецификации); //ЭТО УБЕРЕМ
	Иначе	
		ЗагрузитьДанныеВСправочники(ТаблицаДанныхСпецификации);	
	КонецЕсли;                                                  
	
	
	
КонецПроцедуры   

&НаСервере
Процедура ДобавитьСтрокуСДаннымиВТаблицу(ТаблицаДанныхСпецификации,Лист,НомерСтрокиВЛисте,МассивОшибок)

		НоваяСтрока = ТаблицаДанныхСпецификации.Добавить();
		НоваяСтрока.КодНоменклатуры 			= СокрЛП(Лист.Cells(НомерСтрокиВЛисте,1).Value);
		НоваяСтрока.НаименованиеНоменклатуры 	= СокрЛП(Лист.Cells(НомерСтрокиВЛисте,2).Value);
		НоваяСтрока.АртикулНоменклатуры 		= СокрЛП(Лист.Cells(НомерСтрокиВЛисте,3).Value);
		
		Попытка
			НоваяСтрока.Количество 	= Число(Лист.Cells(НомерСтрокиВЛисте,4).Value);   
		Исключение
			НоваяСтрока.Количество 	= 0;
			МассивОшибок.Добавить(СтрШаблон("Значение ""Количество"" в строке № %1 загружаемого документа не является числом. Установлено значение 0."
												,НомерСтрокиВЛисте));
		КонецПопытки;
		
		Попытка
			НоваяСтрока.Цена	 	= Число(Лист.Cells(НомерСтрокиВЛисте,5).Value);   
		Исключение
			НоваяСтрока.Цена	 	= 0;
			МассивОшибок.Добавить(СтрШаблон("Значение ""Цена без НДС"" в строке № %1 загружаемого документа не является числом. Установлено значение 0."
												,НомерСтрокиВЛисте));
		КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеВСправочники(ТаблицаДанныхСпецификации)
		
	ТаблицаДанныхСпецификации.Колонки.Добавить("НоменклатураКлиента",Новый ОписаниеТипов("СправочникСсылка.НоменклатураКлиентов"));	

	НоваяСпецификация = Справочники.СпецификацииКлиентов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НоваяСпецификация,ЭтотОбъект,"НомерСпецификации,ДатаСпецификации,Клиент");
	НоваяСпецификация.Наименование = СтрШаблон("Спецификация № %1 от %2 (%3)"
												,НомерСпецификации
												,Формат(ДатаСпецификации,"ДЛФ=D")
												,Клиент);

	УстановитьНоменклатуруКлиента(ТаблицаДанныхСпецификации);	
	
	Для каждого СтрокаТаблицы Из ТаблицаДанныхСпецификации Цикл
		НоваяСтрока = НоваяСпецификация.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы,"НоменклатураКлиента,Количество,Цена");  
		НоваяСтрока.Сумма = СтрокаТаблицы.Количество * СтрокаТаблицы.Цена;
	
	КонецЦикла;
	
	Попытка		
		НоваяСпецификация.Записать(); 
		Сообщить(СтрШаблон("Создана новая Спецификация № %1 от %2 (%3)"
							,НоваяСпецификация.НомерСпецификации
							,НоваяСпецификация.ДатаСпецификации
							,НоваяСпецификация.Клиент));  
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	
КонецПроцедуры	

&НаСервере
Функция УстановитьНоменклатуруКлиента(ТаблицаДанныхСпецификации)
	
	ТаблицаДляЗапроса = ТаблицаДанныхСпецификации.Скопировать();
	ТаблицаДляЗапроса.Колонки.Добавить("ИндексВТаблице",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,0,ДопустимыйЗнак.Неотрицательный)));
	
	Для Индекс = 0 По ТаблицаДляЗапроса.Количество() - 1 Цикл
		ТаблицаДляЗапроса[Индекс].ИндексВТаблице = Индекс;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДляЗапроса.ИндексВТаблице КАК ИндексВТаблице,
		|	ТаблицаДляЗапроса.КодНоменклатуры КАК КодНоменклатуры,
		|	ТаблицаДляЗапроса.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
		|	ТаблицаДляЗапроса.АртикулНоменклатуры КАК АртикулНоменклатуры
		|ПОМЕСТИТЬ ТаблицаДляЗапроса
		|ИЗ
		|	&ТаблицаДляЗапроса КАК ТаблицаДляЗапроса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДляЗапроса.ИндексВТаблице КАК ИндексВТаблице,
		|	ЕСТЬNULL(НоменклатураКлиентов.Ссылка, ЗНАЧЕНИЕ(Справочник.НоменклатураКлиентов.ПустаяСсылка)) КАК Ссылка,
		|	ИСТИНА КАК СовпадаетКодНоменклатуры,
		|	ИСТИНА КАК СовпадаетНаименованиеНоменклатуры,
		|	ИСТИНА КАК СовпадаетАртикулНоменклатуры
		|ИЗ
		|	ТаблицаДляЗапроса КАК ТаблицаДляЗапроса
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКлиентов КАК НоменклатураКлиентов
		|		ПО ТаблицаДляЗапроса.КодНоменклатуры = НоменклатураКлиентов.КодНоменклатуры
		|			И ТаблицаДляЗапроса.НаименованиеНоменклатуры = НоменклатураКлиентов.НаименованиеНоменклатуры
		|			И ТаблицаДляЗапроса.АртикулНоменклатуры = НоменклатураКлиентов.АртикулНоменклатуры
		|ГДЕ
		|	НоменклатураКлиентов.ПометкаУдаления = ЛОЖЬ
		|	И НоменклатураКлиентов.Клиент = &Клиент";      
	
	Запрос.УстановитьПараметр("ТаблицаДляЗапроса", ТаблицаДляЗапроса);   
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();   	
	Выборка = РезультатЗапроса.Выбрать();    
	
	Пока Выборка.Следующий() Цикл   
		Если Выборка.СовпадаетКодНоменклатуры И Выборка.СовпадаетНаименованиеНоменклатуры И Выборка.СовпадаетАртикулНоменклатуры Тогда 
			ТаблицаДанныхСпецификации[Выборка.ИндексВТаблице].НоменклатураКлиента = Выборка.Ссылка;		
		КонецЕсли;		
	КонецЦикла; 
		
	Для каждого СтрокаТЗ Из ТаблицаДанныхСпецификации Цикл
		Если СтрокаТЗ.НоменклатураКлиента.Пустая() Тогда 
			СтрокаТЗ.НоменклатураКлиента = СоздатьНовуюНоменклатуруКлиента(СтрокаТЗ); 		
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаДанныхСпецификации;

КонецФункции

&НаСервере
Функция СоздатьНовуюНоменклатуруКлиента(Строка)
	
	НоваяНоменклатураКлиента = Справочники.НоменклатураКлиентов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НоваяНоменклатураКлиента,Строка,"КодНоменклатуры,НаименованиеНоменклатуры,АртикулНоменклатуры");
	ЗаполнитьЗначенияСвойств(НоваяНоменклатураКлиента,ЭтотОбъект,"Клиент");
	
	Попытка
		НоваяНоменклатураКлиента.Записать(); 
		Возврат НоваяНоменклатураКлиента.Ссылка;
		
	Исключение
		Сообщить(ОписаниеОшибки());   
		Возврат Справочники.НоменклатураКлиентов.ПустаяСсылка();
		
	КонецПопытки;

КонецФункции







































//
